# Observations
* Out of the 1163 players, the majority are male with 84% and female with 14%.
* The largest age demographic is the 20-24 age group, following up with 15-19 and 25-29.
* The age group that spends the most money is the 20-24 age group with 1,114 dollars as total purchase value, and average purchase price of 4.32. However, the highest average purchase age group is 35-39 with 4.76 following with a total purchase value of 147.67.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [3]:
#check to see if there are any rows with missing data
purchase_data.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [4]:
#Count the total amount of players by the list of Screen Names (each SN is a different player)
total_players = len(purchase_data["SN"].value_counts())
total_players

576

In [5]:
#Create a DataFrame with total players, named Player Count
player_count = pd.DataFrame({"Total Players": [total_players]})
player_count

   Total Players
0            576

## Purchasing Analysis (Total)

In [6]:
#Number of unique items aka how many different products are there
number_of_unique_items = len((purchase_data["Item ID"]).unique())
number_of_unique_items

179

In [7]:
#Average purchase price
average_purchase_price = '${0:.2f}'.format(purchase_data["Price"].mean())
average_purchase_price

'$3.05'

In [8]:
#Total number of purchases
total_number_purchases = (purchase_data["Purchase ID"]).count()
total_number_purchases

780

In [9]:
#Total revenue
total_revenue = (purchase_data["Price"]).sum()
total_revenue

2379.77

In [10]:
#Create a summary data frame to hold the results
purchasing_analysis_df = pd.DataFrame({"Number of Unique Items": [number_of_unique_items],
                                       "Average Price": [average_purchase_price],
                                       "Number of Purchases": [total_number_purchases],
                                       "Total Revenue": [total_revenue]})
purchasing_analysis_df

   Number of Unique Items Average Price  Number of Purchases  Total Revenue
0                     179         $3.05                  780        2379.77

In [11]:
#clean up the dataFrame
purchasing_analysis_df.style.format({'Total Revenue':'${0:.2f}',
                                         'Total Revenue':'${0:,.2f}'})

## Gender Demographics

In [12]:
#Group purchase_data by Gender
gender_data = purchase_data.groupby("Gender")
gender_data

In [13]:
#count the total of players (screen names) by gender
gender_total_count = gender_data.nunique()["SN"]
gender_total_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [14]:
#Percentages gender total count / total players
percentages_by_gender = gender_total_count/total_players * 100
percentages_by_gender

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [15]:
#Create a summary DataFrame to hold results
gender_demographics_df = pd.DataFrame({"Total Count": gender_total_count,
                                      "Percentage of Players": percentages_by_gender})
gender_demographics_df

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [16]:
#Format DataFrame: no index in the corner
gender_demographics_df.index.name=None

In [17]:
#Sort the values by total count in decending order, and decimal places for percentages
gender_demographics_df.sort_values(["Total Count"], ascending = False).style.format({"Percentage of Players":"{:.2f}%"})


## Purchasing Analysis (Gender)

In [18]:
#count total purchases by gender
purchase_count = gender_data["Purchase ID"].count()
purchase_count

Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [19]:
#average purchase prices by gender
avg_purchase_price = gender_data["Price"].mean()
avg_purchase_price

Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [20]:
# Average purchase total by gender
avg_purchase_total = gender_data["Price"].sum()
avg_purchase_total

Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [21]:
#Average purchase total by gender--avg purchase total/gender total count (so there are no duplicates)
avg_purchase_per_person = avg_purchase_total/gender_total_count
avg_purchase_per_person

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [22]:
#Make that dataFrame
gender_purchase_analysis_df = pd.DataFrame({"Purchase Count": purchase_count,
                                           "Average Purchase Price": avg_purchase_price,
                                          "Total Purchase Value": avg_purchase_total,
                                          "Avg Total Purchase per Person": avg_purchase_per_person})
gender_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [23]:
gender_purchase_analysis_df.style.format({"Average Purchase Price":"${:.2f}",
                                         "Total Purchase Value":"${:.2f}",
                                         "Avg Total Purchase per Person":"${:.2f}"})

## Age Demographics

In [24]:
#Make bins for ages
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 100]
age_groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [25]:
#segment and sort age values into bins 
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], age_bins, labels=age_groups)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [26]:
#Make it a grouped dataFrame
age_group_df = purchase_data.groupby("Age Group")
age_group_df

In [27]:
#count the total players by new age category DONT FORGET TO USE NUNIQUE NOT UNIQUE
total_count_age = age_group_df["SN"].nunique()
total_count_age

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [28]:
#calculate percentages by age total count age/total players
#percentages_by_gender = gender_total_count/total_players * 100
#percentages_by_gender

percentages_by_age = total_count_age/total_players * 100
percentages_by_age

Age Group
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [29]:
#Create a summary dataFrame with results
age_demographics_df = pd.DataFrame({"Total Count": total_count_age,
                                    "Percentage of Players": percentages_by_age})
age_demographics_df

           Total Count  Percentage of Players
Age Group
<10                 17               2.951389
10-14               22               3.819444
15-19              107              18.576389
20-24              258              44.791667
25-29               77              13.368056
30-34               52               9.027778
35-39               31               5.381944
40+                 12               2.083333

In [30]:
#clean up the decimal places, and get rid of the Age Group index
age_demographics_df.index.name = None

age_demographics_df.style.format({"Percentage of Players":"{0:.2f}"})

## Purchasing Analysis (Age)

In [31]:
#count purchases by age group
purchase_count_age = age_group_df["Purchase ID"].count()
purchase_count_age

<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [32]:
#Get average purchase price by age group
average_purchase_price_age = age_group_df["Price"].mean()
average_purchase_price_age

<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [33]:
#Total purchase value by age group
total_purchase_value = age_group_df["Price"].sum()
total_purchase_value

<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [34]:
#Find the average purchase per person within the age group
average_purchase_per_person_by_age = total_purchase_value/total_count_age
average_purchase_per_person_by_age

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [35]:
#Put all the data in a DataFrame
age_demographics_df = pd.DataFrame({"Purchase Count": purchase_count_age,
                                   "Average Purchase Price": average_purchase_price_age,
                                   "Total Purchase Value": total_purchase_value,
                                   "Avg Total Purchase per Person": average_purchase_per_person_by_age})
age_demographics_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [36]:
# Name the index Age Ranges, format the DF
age_demographics_df.index.name = "Age Ranges"
age_demographics_df.style.format({"Average Purchase Price":"{0:.2f}",
                                 "Total Purchase Value":"{0:.2f}",
                                  "Avg Total Purchase per Person":"{0:.2f}"})

## Top Spenders

In [37]:
#Group purchase data by SN
spenders = purchase_data.groupby("SN")
spenders

In [38]:
#count the total purchases by name--purchase ID
purchase_count_spenders = spenders["Purchase ID"].count()
purchase_count_spenders

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [39]:
#calculate the average purchase by name
average_purchase_price_spenders = spenders["Price"].mean()
average_purchase_price_spenders

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [40]:
#Find purchase total
purchase_total_spenders = spenders["Price"].sum()
purchase_total_spenders

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [41]:
top_spenders = pd.DataFrame({"Purchase Count": purchase_count_spenders,
                            "Average Purchase Price": average_purchase_price_spenders,
                            "Total Purchase Value": purchase_total_spenders})
top_spenders

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [42]:
# sort in descender to obtain the top 5 spender names
top_spenders = top_spenders.sort_values(["Total Purchase Value"],
                                       ascending = False).head()
#proper formatting
top_spenders.style.format({"Average Purchase Price":"${:,.2f}",
                          "Total Purchase Value":"${:,.2f}"})

## Most Popular Items

In [43]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [44]:
# Create new data frame with items related information 
items = purchase_data[["Item ID", "Item Name", "Price"]]

# Group the item data by item id and item name 
item_stats = items.groupby(["Item ID","Item Name"])

# Count the number of times an item has been purchased 
purchase_count_item = item_stats["Price"].count()

# Calcualte the purchase value per item 
purchase_value = (item_stats["Price"].sum()) 

# Find individual item price
item_price = purchase_value/purchase_count_item

# Create data frame with obtained values
most_popular_items = pd.DataFrame({"Purchase Count": purchase_count_item, 
                                   "Item Price": item_price,
                                   "Total Purchase Value":purchase_value})

# Sort in descending order to obtain top spender names and provide top 5 item names
popular_formatted = most_popular_items.sort_values(["Purchase Count"], ascending=False).head()

# Format with currency style
popular_formatted.style.format({"Item Price":"${:,.2f}",
                                "Total Purchase Value":"${:,.2f}"})

# #Most Profitable

In [45]:
popular_formatted.sort_values('Total Purchase Value',ascending=False,).head().style.format({'Item Price':'${:.2f}','Total Purchase Value':'${:.2f}'})